class Config:
    # 记录在哪些群组中使用
    used_in_group = ["120332330","209872290","622854120","730911246","955342491","473081444","881232934","549513666","762792972","959233317","820301429","74821097","877388955","569705657","745131656","920359535","691702096","774655949","751972290","477726252","798762938","691311516","849535523","924584753","689025102","864568140","304047442","929172498","671108780","815259733"]

    # 插件执行优先级
    priority = 10
    # 接话冷却时间（秒），在这段时间内不会连续两次接话
    chat_cd = 15
    # 戳一戳冷却时间（秒）
    notice_cd = 120
    # 机器人QQ号
    bot_id = "3520552588"
    # 管理员QQ号，管理员无视冷却cd和触发概率
    super_uid = ["3126410936"]
    vk_uid = ["1505794502"]
    DF_uid = ["1587566493"]
    # 聊天回复概率，用百分比表示，0-100%
    p_chat_response = 0
    # 戳一戳回复概率，用百分比表示，0-100%
    p_poke_response = 100
    # 默认禁言时间，每多戳一次会在默认禁言时间上翻倍
    default_ban_time = 60
